{
    "Beach": [
      "You find a patch of seaweed near the shore.",
      "A crab pinches you, causing minor damage.",
      "You spot a fish and manage to catch it.",
      "High tides force you to retreat, ending your exploration early.",
      "You uncover a small pearl inside a shell.",
      "Strong winds scatter your collected items.",
      "A shark fin appears near the shore, scaring you.",
      "You dig up a clam buried in the sand.",
      "You collect sea glass, glittering under the sunlight."
    ],
    "Mountain": [
      "You stumble upon a rich vein of iron ore.",
      "A goat charges at you, dealing minor damage.",
      "You gather wild berries, avoiding thorny bushes.",
      "Cold winds sap your endurance as you climb.",
      "A rare Edelweiss plant catches your eye.",
      "You narrowly avoid a rockfall.",
      "You discover a hot spring, rejuvenating your stamina.",
      "You spot an eagle feather stuck in a tree."
    ],
    "Caves": [
      "You find a small pocket of glowstone.",
      "A bat screeches and flies at you, causing minor health loss.",
      "You narrowly avoid a cave-in while collecting resources.",
      "A glowing mushroom lights your path.",
      "You slip on wet rocks, losing stamina.",
      "You discover a fossil embedded in the cave wall.",
      "You harvest some cave fish from an underground pond."
    ],
    "Dark Forest": [
      "You gather spider silk from a large web.",
      "A venomous snake bites you, reducing health.",
      "You find glowing mystic herbs.",
      "A shadow beast stalks you from afar.",
      "The forest hums, its presence unnerving you.",
      "You harvest berries, but they might be poisonous.",
      "You stumble upon an ancient tree with dark amber."
    ],
    "Desert": [
      "You uncover an ancient relic buried in the sand.",
      "A scorpion stings you, causing poison damage over time.",
      "You collect cactus flesh for hydration.",
      "A sandstorm blinds you, making navigation difficult.",
      "You discover fossilized plants in the sand.",
      "You dig up a rare Sunstone shimmering in the sunlight.",
      "You find a scarab trapped in a crystal."
    ]
  }
  